minisrv/ab-virtual.out
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /io
Document Length:        2 bytes

Concurrency Level:      200
Time taken for tests:   1.332 seconds
Complete requests:      3000
Failed requests:        0
Total transferred:      288000 bytes
HTML transferred:       6000 bytes
Requests per second:    2252.22 [#/sec] (mean)
Time per request:       88.801 [ms] (mean)
Time per request:       0.444 [ms] (mean, across all concurrent requests)
Transfer rate:          211.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       1
Processing:    52   81   8.3     82     111
Waiting:       51   73   8.2     74      97
Total:         52   81   8.3     82     111

Percentage of the requests served within a certain time (ms)
  50%     82
  66%     83
  75%     84
  80%     85
  90%     88
  95%     92
  98%     95
  99%     97
 100%    111 (longest request)